# AreLBColumnLinesEnabled

## Description
Determines if column lines are drawn.

```pascal
FUNCTION AreLBColumnLinesEnabled(
				dialogID    : LONGINT;
				componentID : LONGINT): BOOLEAN;
```

```python
def vs.AreLBColumnLinesEnabled(dialogID, componentID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|

## Version
Availability: from VectorWorks11.0

## Category
* Dialogs - Modern - Browser